app/controllers/admin_controller.rb

SELECT count(*) AS count_all FROM "radios"
SELECT count(*) AS count_all FROM "users"
---
  def home
    @radio_count = Radio.count(:all)
    @user_count = User.count(:all)

DELETE FROM "radios" WHERE 1=1
DELETE FROM "networks" WHERE 1=1
DELETE FROM "totals" WHERE 1=1
---
  def clear
    Radio.delete_all
    Network.delete_all
    Total.delete_all