app/controllers/networks_controller.rb

SELECT * FROM "networks" LIMIT 20 OFFSET 0
---
  def index
    @networks = Network.paginate(:page => params[:page], :per_page => 20)

INSERT INTO "networks" ("name", "fee") VALUES('sdfsdfsdf', 33)
---
  def create
    @network = Network.new(params[:network])
    if @network.save

SELECT * FROM "networks" WHERE ("networks"."id" = 1)
UPDATE "networks" SET "name" = 'Kouame Network', "fee" = 1240 WHERE "id" = 1
SELECT * FROM "radios" WHERE ("radios"."id" = 11)
UPDATE "radios" SET "network_id" = 1 WHERE "id" = 11
---
  def update
    @network = Network.find(params[:id])
    if @network.update_attributes(params[:network])
      unless params[:radio][:id].blank?
        @network.radios << Radio.find(params[:radio][:id])
        @network.save!

SELECT * FROM "networks" WHERE ("networks"."id" = 1)
---
  def show
    @network = Network.find(params[:id])

SELECT * FROM "networks" WHERE ("networks"."id" = 1)
SELECT * FROM "radios" WHERE ("radios".network_id = 1)
---
  def edit
    @network = Network.find(params[:id])
    @radios = Radio.find(:all)