app/controllers/radios_controller.rb

SELECT * FROM "radios" LIMIT 20 OFFSET 0
SELECT count(*) AS count_all FROM "radios"
---
  def index
    @radios = @books = Radio.paginate(:page => params[:page], :per_page => 20)

SELECT * FROM "radios" WHERE ("radios"."id" = 1210)
---
  def show
    @radio = Radio.find(params[:id])

SELECT * FROM "radios" WHERE ("radios"."id" = 396)
---
  def edit
    @radio = Radio.find(params[:id])

SELECT * FROM "radios" WHERE ("radios"."id" = 1210)
UPDATE "radios" SET "category" = 'National & News' WHERE "id" = 1
---
  def update
    @radio = Radio.find(params[:id])

    respond_to do |format|
      if @radio.update_attributes(params[:radio])

SELECT * FROM "radios" WHERE ("radios"."id" = 1212)
DELETE FROM "radios" WHERE "id" = 1212
---
  def destroy
    @radio = Radio.find(params[:id])
    @radio.destroy

SELECT * FROM "radios" WHERE ("radios"."id" = 6)
SELECT * FROM "networks" WHERE ("networks"."id" = 1)
---
  def calculate
    identifiers = params[:identifiers]
    parts = identifiers.map do |identifier|
      identifier.split("-")
    end
    total = 0
    parts.each do |part|
      if part[2] == "station"
        total = total + Radio.find(part[1]).fee
      elsif part[2] == "network"
        total = total + Network.find(part[1]).fee