app/controllers/reminders_controller.rb

SELECT * FROM "radios" WHERE ("radios"."id" IN (1,3,4,5))
---
  def deliver
    radios =  Radio.find(params[:radios].split(","))