app/controllers/totals_controller.rb

  def index
    @totals = Total.paginate(:page => params[:page], :per_page => 20)
---
SELECT * FROM "totals" LIMIT 20 OFFSET 0

  def create
    @total = Total.new(params[:total])
    if @total.save
---
INSERT INTO "totals" ("name") VALUES('sdasdasd')

  def stations
    total = Total.find(params[:id])
    render :json => total.radios.map{|radio| radio.to_hash}
---
SELECT * FROM "totals" WHERE ("totals"."id" = 1)
SELECT * FROM "radios" WHERE ("radios".total_id = 1)

  def update
    @total = Total.find(params[:id])
    if @total.update_attributes(params[:total])
      @total.radios << Radio.find(params[:radio][:id])
      @total.save!
---
SELECT * FROM "totals" WHERE ("totals"."id" = 1)
UPDATE "totals" SET "note" = 'This is my random note' WHERE "id" = 1
SELECT * FROM "radios" WHERE ("radios"."id" = 21)
UPDATE "radios" SET "total_id" = 1 WHERE "id" = 21

  def show
    @total = Total.find(params[:id])
---
SELECT * FROM "totals" WHERE ("totals"."id" = 1)

  def edit
    @total = Total.find(params[:id])
    @radios = Radio.find(:all)
---
SELECT * FROM "totals" WHERE ("totals"."id" = 1)
SELECT * FROM "radios" WHERE ("radios".total_id = 1)