app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "last_request_at", "crypted_password", "updated_at", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at") VALUES('2010-03-22 22:51:43', NULL, '0919dab754cd48a60e84d374d401f5ae41f73e3d03a68600372c5c1fed29fd433188dddf5a551abada2e612db5f3d060d2bc1c40dbb432787ad8c649e3e2e564', '2010-03-22 22:51:43', NULL, 'B1vIuB2h9dY0XFBrq322', NULL, '9eb1d52e7e3334d0fe20ecdceb901192f8f5cf162bc8450c8f3265b496642d9e8987fad71bf54801b550835d128ac4d2c3dd9eab719ade139ba7caba5168ae53', 0, NULL, 'johnyy', NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
DELETE FROM "users" WHERE "id" = 2
---
  def destroy
    user = User.find(params[:id])
    user.destroy